Revit 2026 API

# ExportPatternTableGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
```

#### Return Value

IEnumeratorKeyValuePairExportPatternKey, ExportPatternInfoAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ExportPatternTable Class

Autodesk.Revit.DB Namespace